Maestro - Example Sessions
==========================

Three examples showing the core workflow: task input, recommendation,
constraint negotiation, and execution.

======================================================================
Example 1: Web Scraping
======================================================================

‚ï≠‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚ïÆ
‚îÇ              Maestro                     ‚îÇ
‚îÇ   Intelligent AI Tool Orchestration      ‚îÇ
‚ï∞‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚ïØ
  Describe a task (scraping, data analysis, or API integration),
  and I'll show you the best approach.

Maestro> Scrape 100 dive shop websites and extract pricing

  (using regex parser)

  Understood: scrape 100 dive shops for pricing

  Analyzing task...

  Here's my recommendation:

  Strategy: Scrapy + Playwright fallback + DeepSeek extraction

    üí∞ Cost: $0.18  ‚úÖ
    ‚ú® Quality: 88%  ‚úÖ
    ‚è±Ô∏è  Time: 1m 17s  ‚úÖ

  Other strategies available ‚Äî say 'show options' to compare, or adjust
  constraints like 'under $1' or 'faster'.

  Proceed with this approach? (yes / show options / adjust)

Maestro> Can we do it for under $0.10?

  Here are your options:

  Option A: Budget Optimized
    Scrapy-only crawling + DeepSeek extraction
    üí∞ Cost: $0.03  ‚úÖ
    ‚ú® Quality: 75%  ‚úÖ
    ‚è±Ô∏è  Time: 84s  ‚úÖ
    ‚ÑπÔ∏è  Scrapy handles crawling (free) and DeepSeek extracts data.
    No JavaScript rendering ‚Äî sites that require JS will fail.

  Option B: Balanced ‚≠ê Recommended
    Scrapy + Playwright fallback + DeepSeek extraction
    üí∞ Cost: $0.18  ‚ö†Ô∏è $0.08 over budget
    ‚ú® Quality: 88%  ‚úÖ
    ‚è±Ô∏è  Time: 1m 17s  ‚úÖ

  Option C: Quality Focused
    Scrapy + Playwright fallback + Claude extraction
    üí∞ Cost: $2.26  ‚ö†Ô∏è $2.16 over budget
    ‚ú® Quality: 95%  ‚úÖ
    ‚è±Ô∏è  Time: 1m 30s  ‚úÖ

  Option D: Speed Optimized
    Parallel Scrapy (3 workers) + DeepSeek extraction
    üí∞ Cost: $0.03  ‚úÖ
    ‚ú® Quality: 75%  ‚úÖ
    ‚è±Ô∏è  Time: 51s  ‚úÖ

  Option E: Scope Reduction
    Balanced approach but 56 sites instead of 100
    üí∞ Cost: $0.10  ‚úÖ
    ‚ú® Quality: 88%  ‚úÖ
    ‚è±Ô∏è  Time: 43s  ‚úÖ

  Which option? (A/B/C/... or adjust constraints)

Maestro> E

  Starting execution...
  ‚è≥ Crawling with Scrapy (47 pages)   ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà 100%
  ‚è≥ Rendering JS pages (9 pages)      ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà 100%
  ‚è≥ Extracting data with DeepSeek     ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà 100%

  ‚úÖ Complete!
    üí∞ Final cost: $0.09
    ‚ú® Quality: 93% (52/56 successful)
    ‚è±Ô∏è  Time: 0m 38s

  Results saved to: output/maestro_results_20260206_143022.json

  üìö Choice recorded for future recommendations.

  Another task? (yes/no) no

  Goodbye!

======================================================================
Example 2: Data Analysis
======================================================================

Maestro> Analyze 500 rows of customer data for trends

  (using regex parser)

  Understood: analyze 500 rows of customer data for trends

  Analyzing task...

  Here's my recommendation:

  Strategy: polars processing + DeepSeek analysis

    üí∞ Cost: $0.00  ‚úÖ
    ‚ú® Quality: 79%  ‚úÖ
    ‚è±Ô∏è  Time: 4s  ‚úÖ

  Proceed with this approach? (yes / show options / adjust)

Maestro> better quality

  Here are your options:

  Option A: Budget Optimized
    pandas processing + DeepSeek analysis
    üí∞ Cost: $0.00  ‚úÖ
    ‚ú® Quality: 75%  ‚úÖ
    ‚è±Ô∏è  Time: 4s  ‚úÖ

  Option B: Balanced ‚≠ê Recommended
    polars processing + DeepSeek analysis
    üí∞ Cost: $0.00  ‚úÖ
    ‚ú® Quality: 79%  ‚úÖ
    ‚è±Ô∏è  Time: 4s  ‚úÖ

  Option C: Quality Focused
    polars processing + Claude analysis
    üí∞ Cost: $0.01  ‚úÖ
    ‚ú® Quality: 86%  ‚úÖ
    ‚è±Ô∏è  Time: 6s  ‚úÖ

  Option D: Speed Optimized
    parallel polars (3 workers) + DeepSeek analysis
    üí∞ Cost: $0.00  ‚úÖ
    ‚ú® Quality: 79%  ‚úÖ
    ‚è±Ô∏è  Time: 4s  ‚úÖ

  Which option? (A/B/C/... or adjust constraints)

Maestro> C

  Starting execution...
  ‚è≥ Loading data (100 rows)           ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà 100%
  ‚è≥ Processing with polars (500 rows) ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà 100%
  ‚è≥ Analyzing with Claude (500 rows)  ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà 100%

  ‚úÖ Complete!
    üí∞ Final cost: $0.01
    ‚ú® Quality: 91% (458/500 successful)
    ‚è±Ô∏è  Time: 0m 5s

  Results saved to: output/maestro_results_20260206_143145.json

======================================================================
Example 3: API Integration
======================================================================

Maestro> Fetch pricing from 20 hotel booking APIs

  (using regex parser)

  Understood: call 20 hotel booking APIs for pricing

  Analyzing task...

  Here's my recommendation:

  Strategy: httpx (async) + DeepSeek parsing

    üí∞ Cost: $0.01  ‚úÖ
    ‚ú® Quality: 86%  ‚úÖ
    ‚è±Ô∏è  Time: 9s  ‚úÖ

  Proceed with this approach? (yes / show options / adjust)

Maestro> faster

  Here are your options:

  Option A: Budget Optimized
    requests (sequential) + DeepSeek parsing
    üí∞ Cost: $0.01  ‚úÖ
    ‚ú® Quality: 81%  ‚úÖ
    ‚è±Ô∏è  Time: 17s  ‚úÖ

  Option B: Balanced ‚≠ê Recommended
    httpx (async) + DeepSeek parsing
    üí∞ Cost: $0.01  ‚úÖ
    ‚ú® Quality: 86%  ‚úÖ
    ‚è±Ô∏è  Time: 9s  ‚úÖ

  Option C: Quality Focused
    httpx (async) + Claude parsing
    üí∞ Cost: $0.07  ‚úÖ
    ‚ú® Quality: 91%  ‚úÖ
    ‚è±Ô∏è  Time: 12s  ‚úÖ

  Option D: Speed Optimized
    httpx parallel (3 workers) + DeepSeek parsing
    üí∞ Cost: $0.01  ‚úÖ
    ‚ú® Quality: 86%  ‚úÖ
    ‚è±Ô∏è  Time: 8s  ‚úÖ

  Which option? (A/B/C/... or adjust constraints)

Maestro> D

  Starting execution...
  ‚è≥ Calling APIs with httpx (20 endpoints)    ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà 100%
  ‚è≥ Parsing responses with DeepSeek (20)      ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà 100%

  ‚úÖ Complete!
    üí∞ Final cost: $0.01
    ‚ú® Quality: 90% (18/20 successful)
    ‚è±Ô∏è  Time: 0m 7s

  Results saved to: output/maestro_results_20260206_143312.json
